var num1 = '99999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999'
    num2 = '88888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888888'
   
    //?? 大数相加 数字超过语言的计算范围
    //  两数相加 小时候 从最后一位开始计算 
    // 如果这个数可以在内存中表达数字型number,如果这个数字太大就是infinity(无限)
    // 能够把每个数的最后一位相加

    function addTwoNumber(str1,str2){//把它变成字符串
        var carry = 0;//添加变量来进行进位 变量 可以一直计算每一回合的进位
        l1 = str1.length,//长度
        l2 = str2.length,
        arr = [];//放结果de

        var max = Math.max(l1,l2);//不一样长
        for(var i=l1-1,j=l2-1,n=max-1;n>=0;n--,i--,j--){
            var sum = (+str1[i] || 0)+(+str2[j] || 0)+carry;//每一次的相加和 parseInt将字符串转化为数字
            // console.log(sum);
            // break;核查问题
            if(sum >= 10){
                carry = 1;
                arr.push(sum-10);
            }else{
                carry = 0;
                arr.push(sum); 
            }
        }

        if(carry>0) arr.push(carry);
        return arr.reverse().join('');//颠倒里面的数
        //表示最多进行多少次计算
        // 1.字符串从尾部到首部相加？
        // 2.两个数的位数可能不一样？
    }
    console.log(addTwoNumber(num1,num2));